app/views/comments/_comment.html.haml

%h3
  = pluralize(@post.comments.count, "Comment")

- @post.comments.each do |c|
---
SELECT COUNT(*) FROM `comments` WHERE (`comments`.post_id = 4)
SELECT `comments`.* FROM `comments` WHERE (`comments`.post_id = 1) ORDER BY created_at DESC