app/controllers/canned_foods_controller.rb

SELECT `canned_foods`.* FROM `canned_foods` WHERE (name LIKE '%no%')
---
  def index
    @canned_foods = CannedFood.search(params[:search])

SELECT `canned_foods`.* FROM `canned_foods` WHERE (`canned_foods`.`id` = 1) LIMIT 1
---
  def show
    @canned_food = CannedFood.find(params[:id])

INSERT INTO `canned_foods` (`name`, `quantity`, `quality`, `procedure`, `pack_style`, `jar_size`, `process_time_1`, `process_time_2`, `process_time_3`, `process_time_4`, `process_pressure`, `created_at`, `updated_at`) VALUES ('ASPARAGUS—SPEARS OR PIECES', 'An average of 24-1/2 pounds is needed per canner load of 7 quarts; an average of\r\n16 pounds is needed per canner load of 9 pints. A crate weighs 31 pounds and yields 7 to 12\r\nquarts—an average of 3-1/2 pounds per quart.', 'Use tender, tight-tipped spears, 4 to 6 inches long.', 'Wash asparagus and trim off tough scales. Break off tough stems and wash again. Cut into 1-inch pieces or can whole.\r\n\r\nHot pack—Cover asparagus with boiling water. Boil 2 or 3 minutes. Loosely fill hot jars with hot asparagus, leaving 1-inch headspace.\r\n\r\nRaw pack—Fill hot jars with raw asparagus, packing as tightly as possible without crushing, leaving 1-inch headspace.\r\n\r\nAdd 1 teaspoon of salt per quart to the jars, if desired. Add boiling water, leaving 1-inch headspace. Remove air bubbles and adjust headspace if needed. Wipe rims of jars with a dampened clean paper towel. Adjust lids and process.', 'Hot and Raw', 'Pints', 11, 12, 13, 14, NULL, '2011-01-06 22:23:56', '2011-01-06 22:23:56')
---
  def create
    @canned_food = CannedFood.new(params[:canned_food])

    respond_to do |format|
      if @canned_food.save