app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 0) LIMIT 1
INSERT INTO `comments` (`post_id`, `name`, `email`, `body`, `created_at`, `updated_at`) VALUES (NULL, 'jjjj', 'asddf', 'asdf', '2010-12-15 03:10:28', '2010-12-15 03:10:28')

  def destroy
    #@post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE (`comments`.`id` = 15) LIMIT 1
DELETE FROM `comments` WHERE (`comments`.`id` = 15)