app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 50 OFFSET 0

  def show
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `body`, `published`, `created_at`, `updated_at`, `permalink`) VALUES ('New Name', 'New poast', 0, '2011-01-12 00:24:34', '2011-01-12 00:24:34', NULL)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 1) LIMIT 1
UPDATE `posts` SET `body` = 'Posty posty postyasdf', `updated_at` = '2010-12-16 07:13:21' WHERE (`posts`.`id` = 1)

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`id` = 3) LIMIT 1
DELETE FROM `posts` WHERE (`posts`.`id` = 3)